annoyedmilk/esp32-s31-linux/bootloader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_320=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# The LCD data bus needs GPIO33/34, which are also the native USB
# Serial/JTAG D-/D+ pins, and the loader initializes the display only when no
# secondary console claims them.  Flashing and the Linux console run over the
# CP2102N UART bridge, so the port is only given up for JTAG: select
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG to get OpenOCD back and leave
# the panel dark.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
